In [1]:
import pandas as pd

In [4]:
#default index
data=[1,2,3,4,5]
s1=pd.Series(data)
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
#custom index
index=['a','b','d','c','e']
s2=pd.Series(data, index=index)
print(s2)

a    1
b    2
d    3
c    4
e    5
dtype: int64

In [11]:
#dataframe
s1=pd.Series([24,34,25,32,22], name="age")
s2=pd.Series(["Nai","Kisumu","Nakuru","Eldoret","Kampala"], name="city")
s3=pd.concat([s1,s2],axis=1)
print(s3)

   age     city
0   24      Nai
1   34   Kisumu
2   25   Nakuru
3   32  Eldoret
4   22  Kampala

In [12]:
data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [25, 30, 35, 40],
    'city': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data, index=['A', 'B', 'C', 'D'])
df

      name  age           city
A    Alice   25       New York
B      Bob   30  San Francisco
C  Charlie   35    Los Angeles
D    David   40        Chicago

In [17]:
df.loc['A':'C']

      name  age           city
A    Alice   25       New York
B      Bob   30  San Francisco
C  Charlie   35    Los Angeles

In [18]:
print(df.loc[['A','C']])

      name  age         city
A    Alice   25     New York
C  Charlie   35  Los Angeles

In [27]:
print(df.loc[['B','D'],['age','name']])

   age   name
B   30    Bob
D   40  David

In [21]:
print(df.loc['B','age'])

30

In [28]:
data={
    'name':("jaja","jeje","jiji","juju"),
    'age':(22,34,23,14),
    'city':("saja","seje","siji","suju")
}

data

{'name': ('jaja', 'jeje', 'jiji', 'juju'),
 'age': (22, 34, 23, 14),
 'city': ('saja', 'seje', 'siji', 'suju')}

In [29]:
df=pd.DataFrame(data, index=["A","B","C","D"])
print(df)

   name  age  city
A  jaja   22  saja
B  jeje   34  seje
C  jiji   23  siji
D  juju   14  suju

In [30]:
df.iloc[0]

name    jaja
age       22
city    saja
Name: A, dtype: object

In [32]:
df.iloc[[-2, -1]]

   name  age  city
C  jiji   23  siji
D  juju   14  suju

In [2]:
#Renaming column and indexes

In [3]:
data={
    'A':[1,2,3],
    'B':[4,5,6],
    'C':[7,8,9]
}
df1=pd.DataFrame(data, index=["X","Y","Z"])
df1

   A  B  C
X  1  4  7
Y  2  5  8
Z  3  6  9

In [5]:
df1=df1.rename(columns={"A":"col_A","B":"col_B","C":"col_C"})
df1

   col_A  col_B  col_C
X      1      4      7
Y      2      5      8
Z      3      6      9

In [6]:
df1=df1.rename(index={"X":"row_A","Y":"row_B","Z":"row_C"})
df1

       col_A  col_B  col_C
row_A      1      4      7
row_B      2      5      8
row_C      3      6      9

In [7]:
#Merging joining and concatenating DataFrame

In [18]:
data1={
    'A':[1,3,5],
    'B':[2,4,6]
}
data2={
    'A': [4,6,8],
    'B' : [3,7,4]
}
df2=pd.DataFrame(data1,index=["X",'Y','Z'])
df3=pd.DataFrame(data2, index=['Y','Z','W'])
df2

   A  B
X  1  2
Y  3  4
Z  5  6

In [19]:
df3

   A  B
Y  4  3
Z  6  7
W  8  4

In [20]:
df_concat=pd.concat([df2,df3])
df_concat

   A  B
X  1  2
Y  3  4
Z  5  6
Y  4  3
Z  6  7
W  8  4

In [21]:
df_vertical=pd.concat([df2,df3],ignore_index=True)
df_vertical

   A  B
0  1  2
1  3  4
2  5  6
3  4  3
4  6  7
5  8  4

In [22]:
df_horizontal=pd.concat([df2,df3],axis=1)
df_horizontal

     A    B    A    B
X  1.0  2.0  NaN  NaN
Y  3.0  4.0  4.0  3.0
Z  5.0  6.0  6.0  7.0
W  NaN  NaN  8.0  4.0

In [25]:
data1 = {
    'A': [1, 2, 3],
    'B': [4, 5, 6]
}
data2 = {
    'C': [7, 8, 9],
    'D': [10, 11, 12]
}
df4=pd.DataFrame(data1, index=['X','Y','Z'])
df5=pd.DataFrame(data2, index=['Y','Z','W'])

In [26]:
df_joined=df4.join(df5,how="left")
df_joined

   A  B    C     D
X  1  4  NaN   NaN
Y  2  5  7.0  10.0
Z  3  6  8.0  11.0

In [27]:
data = {
    'A': [1, 2],
    'B': [3, 4]
}
df = pd.DataFrame(data)
df

   A  B
0  1  3
1  2  4

In [28]:
df['C']=[5,6]
df

   A  B  C
0  1  3  5
1  2  4  6

In [31]:
df=df.drop(1, axis=0)
df

   A  B  C
0  1  3  5

In [1]:
import streamlit as st

In [2]:
st.write("choose a number")

2024-06-25 18:03:33.328
  Warning: to view this Streamlit app on a browser, run it with the following
  command:

    streamlit run C:\Users\Admin\anaconda3\Lib\site-packages\ipykernel_launcher.py [ARGUMENTS]